In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('data.csv')

In [3]:
data

    day  amount
0   1/7      30
1  1/11      10
2  1/12      10
3  1/13      47
4  1/14      37
5  1/17      43
6  1/18      58
7  1/19      58
8  1/20      30

In [4]:
sum(data['amount'])

323

In [5]:
data['amount'].mean()

35.888888888888886

In [6]:
data.describe()

          amount
count   9.000000
mean   35.888889
std    17.898634
min    10.000000
25%    30.000000
50%    37.000000
75%    47.000000
max    58.000000

In [7]:
data_sorted = data.sort_values('amount')

In [8]:
data_wiht_mean =data['amount'==58] = data['amount'].mean()

In [9]:
data_wiht_mean

35.888888888888886

In [10]:
data_wiht_mean = data.replace(58, data['amount'].mean())

In [11]:
data_wiht_mean

    day     amount      False
0   1/7  30.000000  35.888889
1  1/11  10.000000  35.888889
2  1/12  10.000000  35.888889
3  1/13  47.000000  35.888889
4  1/14  37.000000  35.888889
5  1/17  43.000000  35.888889
6  1/18  35.888889  35.888889
7  1/19  35.888889  35.888889
8  1/20  30.000000  35.888889

In [12]:
data_wiht_mean.describe()

          amount      False
count   9.000000   9.000000
mean   30.975309  35.888889
std    13.075726   0.000000
min    10.000000  35.888889
25%    30.000000  35.888889
50%    35.888889  35.888889
75%    37.000000  35.888889
max    47.000000  35.888889

In [8]:
data_sorted

    day  amount
1  1/11      10
2  1/12      10
0   1/7      30
8  1/20      30
4  1/14      37
5  1/17      43
3  1/13      47
6  1/18      58
7  1/19      58

In [11]:
data_trimed = data_sorted[0:7]

In [12]:
data_trimed.describe()

          amount
count   7.000000
mean   29.571429
std    14.751917
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    47.000000